// Модуль формы просмотра Подписок на события

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузитьПодписки();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьПодписки()
	ТаблицаПодписок.Очистить();
	Для Каждого Подписка Из Метаданные.ПодпискиНаСобытия Цикл
		НоваяСтрока = ТаблицаПодписок.Добавить();
		НоваяСтрока.Имя          = Подписка.Имя;
		НоваяСтрока.Синоним      = Подписка.Синоним;
		НоваяСтрока.Событие      = Подписка.Событие;
		НоваяСтрока.Обработчик   = Подписка.Обработчик;
		НоваяСтрока.Источник     = Строка(Подписка.Источник);
	КонецЦикла;
КонецПроцедуры
